{"method":"GET","status":"success","generated":"2018-06-03T22:13:47+08:00","conference":{"name":"HKOSCon 2018","sponsors":{"gold":{"name":"Gold","sponsors":[{"title":"Gandi","logo":"https://data.hkoscon.org/sites/default/files/styles/width_550/public/2018-05/gandi.jpg?itok=4ylDZQd5","description":"<p>Gandi is the No Bullshit™ domain name registrar and hosting provider. Created in France in 1999, Gandi is now present in 3 continents,with offices in Paris, San Francisco, Luxembourg, and Taipei. We position ourselves as the next port of call for those who want to create an online presence, right after Internet access providers, since domain names are the firststep in creating your own piece of the Internet.</p>\r\n","links":[{"title":"Gandi.net Website","url":"https://www.gandi.net/"}]},{"title":"HK01","logo":"https://data.hkoscon.org/sites/default/files/styles/width_550/public/2018-05/highres_HK01_logo1_2018.png?itok=mKFJKKdM","description":"<p>HK01 is aspired to build a Hong Kong Internet Lifestyle Platform which provides personalized and diversified Internet services under the digital era. We are dedicated to becoming the pioneer and leader of the Hong Kong Internet industry by providing factual and inspiring contents through the application of innovative technology.</p>\r\n\r\n<p>HK01 provides future leaders with the intelligence, technology, human expertise and the career development platform they need to revolutionize the Internet industry in Hong Kong. Let’s join hands together to break new ground in the digital world for now and the future.</p>\r\n\r\n<p><strong>屬於香港人的互聯網生活平台</strong></p>\r\n\r\n<p>香港01通過應用創新科技推送事實和富靈感的內容，以及提供個人化和多元化的互聯網服務，致力構建一個屬於香港人的互聯網生活平台，並成為香港互聯網行業的先驅和領導者。</p>\r\n\r\n<p>香港01為未來的領導者提供智慧、技術及職業發展平台等，為香港互聯網行業帶來革命性的變化。讓我們一起打破現在和創建未來的互聯網生態。</p>\r\n","links":[{"title":"HK01 Website","url":"https://www.hk01.com/"}]},{"title":"Enuma Technologies","logo":"https://data.hkoscon.org/sites/default/files/styles/width_550/public/2018-05/logo-orange-black-sqr.png?itok=yaUNmr2s","description":"<p>Enuma Technologies is a leading software engineering firm with expertise covering the full blockchain spectrum.</p>\r\n\r\n<p>As an early entrant in the blockchain space, Enuma has enabled enterprises to explore and implement cutting edge technologies to gain competitive advantage.</p>\r\n\r\n<p>Enuma has successfully designed and executed a number of high profile projects including blockchain platforms, asset exchanges, payment, identity, and security solutions for enterprises across the US, Europe and Asia.</p>\r\n","links":[{"title":"Enuma Website","url":"https://enuma.io"}]}]},"silver":{"name":"Silver","sponsors":[{"title":"MySQL","logo":"https://data.hkoscon.org/sites/default/files/styles/width_550/public/2018-05/logo-mysql-500.jpg?itok=KnpNnkrq","description":"<p>MySQL is the world's most popular OS database. With its proven performance, reliability and ease-of-use, MySQL has become the leading database choice for web-based applications, used by high profile web properties including Facebook, Twitter, YouTube, Yahoo! and many more. Additionally, it is an extremely popular choice as embedded database, distributed by over 3,000 ISVs &amp; OEMs. To organizations in need of an open source, ACID-compliant transactional database delivering real-time in-memory performance and 99.999 percent availability, Oracle offers MySQL Cluster.</p>\r\n\r\n<p>MySQL Enterprise Edition is a commercial offering comprised of the MySQL database with security, encryption, auditing, high availability and scalability extensions, online backup, monitoring, management, and visual database design and SQL development tools. MySQL Enterprise Edition is backed by Oracle Premier support for organizations delivering highly available, business critical applications and services. Oracle MySQL Cloud Service delivers a secure, cost-effective and enterprise-grade MySQL database service. Built on MySQL Enterprise Edition and powered by the Oracle Cloud, it provides a simple, automated, integrated and enterprise ready MySQL cloud service, enabling organizations to increase business agility and reduce costs.</p>\r\n\r\n<p>Oracle drives MySQL innovation, constantly improving MySQL solutions and delivering new capabilities to power next generation web, cloud, mobile and embedded applications.</p>\r\n","links":[{"title":"MySQL Website","url":"https://www.mysql.com/"}]}]},"venue":{"name":"Venue","sponsors":[{"title":"Hong Kong Science and Technology Park","logo":"https://data.hkoscon.org/sites/default/files/styles/width_550/public/2018-05/hkstp-logo.png?itok=2Kkwd3Wr","description":"","links":[{"title":"Hong Kong Science and Technology Park","url":"https://www.hkstp.org/en"}]}]},"general":{"name":"General","sponsors":[{"title":"JetBrains","logo":"https://data.hkoscon.org/sites/default/files/styles/width_550/public/2018-05/jetbrains.jpg?itok=_ZpYZ6_v","description":"<p>JetBrains PyCharm is the intelligent Python IDE for Professional Developers providing a complete set of tools for productive Python, Web and Scientific development. PyCharm comes in two editions. The free and open-source PyCharm Community Edition is perfect for pure Python and scientific development. PyCharm Professional Edition is designed for professional Python and Web developers.</p>\r\n","links":[{"title":"JetBrains Website","url":"https://www.jetbrains.com/"}]}]}},"patrons":["Claire Wong @blurryclaire","Calvin Tsang","Dick Tang @dictcp","BeamStyle","AgilePoint Inc. - hpaPaaS."]}}