{"method":"GET","status":"success","days":[{"day":1,"date":"2018-06-16","timeslots":[{"startTime":"09:30","endTime":"10:00","events":[{"topic":false,"display":"Lightning Talk & Unconference Registrations","description":"<p>Begin to accept registration for Lightening Talk and Unconference.</p>\r\n","venue":{"name":"Reception Area"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/lightning-talk-unconference-registrations"},{"topic":false,"display":"Reception","description":"<p>Volunteers will be receiving all participants and guests at the reception area.</p>\r\n","venue":{"name":"Reception Area"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/reception"}]},{"startTime":"10:00","endTime":"10:30","events":[{"topic":false,"display":"Opening and Opening Remark","description":"<ul>\r\n\t<li>Opening and Announcements</li>\r\n\t<li>Guest of Honor</li>\r\n\t<li>Opening Remark</li>\r\n</ul>\r\n","venue":{"name":"Charles K Kao Auditorium"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/opening-and-opening-remark"}]},{"startTime":"10:30","endTime":"11:00","events":[{"topic":true,"display":"Maintaining Open Source While Maintaining Your Sanity","description":"<p>Maintaining open source projects can be hard. Between the haters, noobs and entitled masses it can be tough to stay motivated. Learn from my experience how to maintain your sanity along with your code. I'll give some tips and tricks for structuring your project, fostering a positive attitude, growing your community and dealing with guilty feelings when you can't keep up with all the noise.</p>\r\n\r\n<p>Maintaining open source projects can be hard. Successful open source projects can take up a lot of your time and often you end up feeling guilty because you feel you are not spending enough time working on it. You are not alone!</p>\r\n\r\n<p>I’ve been an open source contributor for a very long time and a core maintainer of Apache Cordova for over 8 years. I’ve learned a number of things that can help you stay on top of your project without the guilty feelings.</p>\r\n\r\n<p>First we will go over the basic setup of an open source project and talk about the importance of files you see in a lot of repositories like README, CONTRIBUTING and LICENSE. Then we will go over how to effectively triage issues and how an issue template can help you with that. We’ll also discuss how to turn contributors of your project into maintainers as well as the edict around pull requests.</p>\r\n\r\n<p>Finally we’ll discuss how it is more difficult to deal with people than with code and the importance of setting boundaries.</p>\r\n","venue":{"name":"Charles K Kao Auditorium"},"language":"English","level":"Beginner","speakers":[{"name":"Simon MacDonald","community":"Adobe","country":"Canada","description":"<p><span>Simon has over twenty years of development experience and has worked on a variety of projects including object oriented databases, police communication systems, speech recognition and unified messaging. His current focus is contributing to the open source PhoneGap project to enable developers to create cross platform mobile applications using Web technologies. Simon’s been building web applications since the days they were written using shell scripts and he still has nightmares about those dark days.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Simon%20MacDonald%20w500%20grey_0.jpg"}],"internal":"https://data.hkoscon.org/event/maintaining-open-source-while-maintaining-your-sanity"}]},{"startTime":"11:05","endTime":"11:35","events":[{"topic":true,"display":"Why your domain name matters","description":"<p>This talk will give you an introduction how to choose your domain name and why it is more important than ever to own your own domain name for your open source projects or business.</p>\r\n","venue":{"name":"Charles K Kao Auditorium"},"language":"English","level":"Open to All","speakers":[{"name":"Thomas Kuiper","community":"Gandi.net","country":"Taiwan","description":"<p>Thomas Kuiper, the General Manager of the Asia subsidiary of the domain name registrar Gandi is originally from Germany. He worked on embedded systems and content management systems for companies in Taiwan and Europe before he set himself to the task to start Gandi's Asia business unit. Gandi (abbreviation for \"Gestion et Attribution des Noms de Domaine sur Internet\" in French or \"Management and Allocation of Domain Names on the Internet\" in English) is a company thatg provides domain name registration and management in addition to Internet hosting infrastructure and related services.</p>\r\n\r\n<p>The company has its head office in Paris and offices in San Francisco, Luxembourg and Taipei to serve its customers around the clock. Gandi was among the first European domain name registrars to offer \".COM\" and \".NET\" and now manages over 2 million domain names with accreditation for over 700 different domain name extensions for its customers, placing Gandi among the top domain name registrars worldwide.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Thomas%20Kuiper%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/why-your-domain-name-matters"}]},{"startTime":"12:15","endTime":"12:45","events":[{"topic":true,"display":"Blockchain Scalability solutions - How to build decentralized exchanges","description":"","venue":{"name":"Charles K Kao Auditorium"},"language":"English","level":"","speakers":[{"name":"Lionello Lunesu","community":"Enuma Technologies","country":"Hong Kong","description":"<p>Lionello is a top caliber architect and entrepreneur with twenty years of experience in both software and hardware. He pioneered and accrued broad expertise in blockchain, virtual reality, e-commerce, cloud computing, and IoT. In 1997, he founded one of the world’s first virtual-reality software companies, which was later acquired by a multinational company for its real-time 3D rendering technology. Fifteen of the flight simulators he built can be found at the Smithsonian Air and Space museum in Washington D.C. Since then, Lionello has led various development teams in both startups and multinationals across Europe and Asia. In 2010, Lionello joined Microsoft where he led teams on SQL Server, Windows, and the Commerce Platform. He is also a passionate educator and leader within technology communities and maker spaces, teaching developers programming and electronics. Lionello is fluent in English, Dutch, Italian, Mandarin and Romanian.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-06/Lionello%20Lunesu.jpeg"}],"internal":"https://data.hkoscon.org/event/blockchain-scalability-solutions-how-build-decentralized-exchanges"}]},{"startTime":"12:45","endTime":"14:00","events":[{"topic":false,"display":"Lunch & Expo","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/lunch-expo"}]},{"startTime":"14:00","endTime":"14:30","events":[{"topic":true,"display":"Using Web Software Architecture in Traditional Desktop App Development - How Flux/Redux was ported to Qt/QML.","description":"<p>The development experience of desktop and web application is different, but their gap is getting closer. A modern JavaScript application also needs a build script for “compilation\" for deployment like a desktop application.</p>\r\n\r\n<p>At the same time, the desktop environment is adopting the web technology. Qt, being one of the most popular cross-platform development frameworks, introduced a language called QML in its 4.7 version. It provides a declarative way to design the user interface and handle user response by JavaScript. It is a solution to speed up the development time of making a user interface.</p>\r\n\r\n<p>What happens if more web technology is being used on desktop development?</p>\r\n\r\n<p>The speaker is going to share his experience in porting Flux/Redux to QML,&nbsp; promise chaining to C++, and his vision on future desktop development technology.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Intermediate","speakers":[{"name":"Ben Lau","community":"E-Fever Limited","country":"Hong Kong","description":"<p><span>Ben Lau is a conceptor, maker and a full stack developer who keep building open source projects. He is a long time Qt Developer. He was the first Qt Ambassador from Hong Kong and obtained the title of Qt Champion 2016. </span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ben%20Lau.jpg"}],"internal":"https://data.hkoscon.org/event/using-web-software-architecture-traditional-desktop-app-development-how-fluxredux-was-ported"},{"topic":true,"display":"Blockchain for creative contents: What we do in LikeCoin","description":"","venue":{"name":"Conference Hall 6"},"language":"English","level":"Beginner","speakers":[{"name":"Aludirk Wong","community":"LikeCoin Foundation","country":"Hong Kong","description":"<p><span>Aludirk is a system architect of the LikeCoin Foundation, an open source blockchain based project to reinvent the Like by realigning creativity and reward. He is interested in system design, deep learning and blockchain technology.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Aludirk%20Wong.jpg"}],"internal":"https://data.hkoscon.org/event/blockchain-creative-contents-what-we-do-likecoin"},{"topic":true,"display":"Haxe as a better JavaScript: a practical guide for making front end development fun, fast and less overwhelming","description":"<p>\"JavaScript Fatigure\" is real. In the last 5 years JS has moved from being something used to progressively enhance a web page, to being the driving engine that powers entire web apps. And as we try to do more with JavaScript, we need more tooling. Webpack, Babel, CSS Modules and type checking. And we needed more frameworks: we went from jQuery everywhere to Backbone, Angular, React and Redux and MobX and Preact and more. It some point, it got really, really complex, hard to get started, easy to break, and less fun to build.</p>\r\n\r\n<p>In this talk I explore how Haxe, a mature programming language that compiles to (among other things) JavaScript, is a great way to make front end development fun, fast, and less overwhelming.</p>\r\n\r\n<p>I'll give a fair comparison of the strengths and weaknesses compared to JavaScript, and then explore how Haxe's unique strengths can make for happy web development, how you can happily interact with JS tooling (like Webpack!) and frameworks (like React!) while avoiding feeling like you're drowning in front-end complexity.</p>\r\n","venue":{"name":"Conference Hall 7"},"language":"English","level":"Open to All","speakers":[{"name":"Jason O'Neil","community":"Culture Amp","country":"Perth, Australia","description":"<p><span>I'm a software engineer at Culture Amp where I focus on front end developer tooling. I've been using Haxe for years, have released several Haxelibs and have previously launched two start-ups, both built with Haxe.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Jason%20O%27Neil.jpg"}],"internal":"https://data.hkoscon.org/event/haxe-better-javascript-practical-guide-making-front-end-development-fun-fast-and-less"}]},{"startTime":"14:40","endTime":"15:10","events":[{"topic":true,"display":"Containerized High Availability Virtual Hosting Deployment with Kubernetes, Docker and Ansible","description":"<p>Containerized High Availability Virtual Hosting Deployment with Kubernetes, Docker and Ansible. Demonstration will be prepared. Drupal 8 will be the example.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Intermediate","speakers":[{"name":"Edison Wong","community":"PantaRei Design Limited","country":"Hong Kong","description":"<p><span>Edison Wong is CEO and founder of PantaRei Design Limited, he is an active open source contributor focus on Drupal Content Management System. He is organizer of Hong Kong Drupal User Group. He also develop other solution to support Drupal environment with OAuth 2 Single Sign-On and Containerized High Availability Virtual Hosting with Kubernetes, Docker and Ansible.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Edison%20Wong.jpg"}],"internal":"https://data.hkoscon.org/event/containerized-high-availability-virtual-hosting-deployment-kubernetes-docker-and-ansible"},{"topic":true,"display":"Dapp: a new approach to combine blockchain and cryptography into web application","description":"<p>Dapp is the new approach to combine the power of blockchain and modern cryptography into the web application. In this session, we will demo how to build a simple web application using web3 and MetaMask, and manipulate the Ethereum chain with it.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Beginner","speakers":[{"name":"Chung Wu","community":"LikeCoin Foundation","country":"Hong Kong","description":"<p><span>Chung Wu is a software developer who enjoyed reading technical articles more than writing code. Like to learn stuff which most developers ignore, e.g. cryptography, programming language design, while not practically using them.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Chung%20Wu.jpg"}],"internal":"https://data.hkoscon.org/event/dapp-new-approach-combine-blockchain-and-cryptography-web-application"},{"topic":true,"display":"Type-safe REST API with Haxe","description":"<p>RESTful API is arguably the most used standard of the web today. This talk will give you a taste on how it could be seamlessly integrated with the type-safe programming language - Haxe.</p>\r\n","venue":{"name":"Conference Hall 7"},"language":"English","level":"Open to All","speakers":[{"name":"Kevin Leung","community":"Haxe community","country":"Hong Kong","description":"<p><span>A freelancer who uses Haxe most of the time</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Kevin%20Leung.jpg"}],"internal":"https://data.hkoscon.org/event/type-safe-rest-api-haxe"}]},{"startTime":"15:20","endTime":"15:50","events":[{"topic":true,"display":"Memory Forensics 101","description":"<p>This talk will be about what memory forensics is, who would be encountering, why and when we need to dig in the memory. Following with showcase of one of the most robust memory forensics toolkit - volatility framework. Participant would expect after some introductory slides, live demo (mainly command line interface) would take place. Though it is not necessary, it is encouraged that participant would bring their own laptop to follow the demo if they wish to.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Intermediate","speakers":[{"name":"Hayden Chung","community":"","country":"Hong Kong","description":"<p><span>Hayden Chung, a freelance system administrator, describes himself as an information security fanatics which loves to try out new technology. Former guest speaker in OSHK starting from 2014. A community member of Mozilla Hong Kong.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Hayden%20Chung%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/memory-forensics-101"},{"topic":true,"display":"Blockchain and Distributed Ledger Technology for Documents","description":"<p>Blockchain is a type of DLT in which records are organized in blocks that are appended to a&nbsp;single chain using cryptography and distributed consensus. Each block contains a time stamp and a link to the previous block, ensuring that data in a block cannot&nbsp;be altered retroactively.&nbsp;This makes blockchain a good choice for the recording of events, provenance tracking, and document&nbsp;life-cycle management.&nbsp;Signing a PDF in the blockchain instead of storing a signature in a PDF reduces the complexity of the&nbsp;code for a developer who needs digital signing and verification functionality.&nbsp;The same&nbsp;principle can be used in many other use&nbsp;cases to implement a document workflow, to keep track of the location of a document, and much more.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"","speakers":[{"name":"Joris Schellenkens","community":"iText software","country":"Belgium","description":"<p><span>Joris is currently a software developer at iText well-known with the pdf library in Java and .NET. Joris' background is in machine learning, NLP, mathematics, graphs and NP-complete problems.</span></p>\r\n\r\n<p><span>After having worked in the supply-chain industry, he set his sights on document-processing and&nbsp;workflow-automation.At the&nbsp;beginning of 2017 he learned about blockch ain and it’s disrupti ve capabili ties and then he hasbeen hooked on the possibilities&nbsp;of Blockchain Technology ever since. At iText he focuses mostly on innovative research projects and conceptualizing those&nbsp;ideas.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Joris%20Schellenkens.png"}],"internal":"https://data.hkoscon.org/event/blockchain-and-distributed-ledger-technology-documents"}]},{"startTime":"15:50","endTime":"16:20","events":[{"topic":false,"display":"Afternoon Break & Expo","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/afternoon-break-expo"}]},{"startTime":"16:20","endTime":"16:50","events":[{"topic":true,"display":"Git Time Travellers","description":"<p>Changing the history of a Git repository is something you typically don't (want to) do. But&nbsp;what if you get the task to make your&nbsp;closed source applications open source? That's exactly how we spent our summer. In this talk we will share our adventure in&nbsp;changing history. We'll be going over our initial approach, the rough way, and the more elegant way. We'll gladly share the&nbsp;pitfalls both foreseen and unforeseen we came across and how we resolved them.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"","speakers":[{"name":"Michael Demey","community":"iText software","country":"Belgium","description":"<p><span>Michael is interested in Open Source software and licenses Michaël has been a developer at iText Software since 2011.</span></p>\r\n\r\n<p><span>Working closely together with its users he has a keen insight on how the real world uses P</span><span>DF.&nbsp; He has been known to have short flings with other JVM languages, but at heart he's a Java Developer.</span></p>\r\n\r\n<p><span>When he's not looking at PDF syntax, he likes to play music and (tries to ) develop games.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Michael%20Demey%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/git-time-travellers"},{"topic":true,"display":"Let's Fix The Internet","description":"<p>The Internet today is plagued by many problems. From viruses and spam, to identity theft and piracy.</p>\r\n\r\n<p>We can solve those problems.</p>\r\n\r\n<p>With a virtual operating system that runs the cloud, using blockchains to secure identities and data, a virtual network layer to protect agains unauthorized network access, and a virtual machine to sandbox untrusted code.</p>\r\n\r\n<p>This talk will describe Elastos, an Operating System for the smart web.</p>\r\n\r\n<p>It will explore the approach that Elastos takes to achieve these goals, and gives a vision of a possible future internet.</p>\r\n\r\n<p>Elastos is an ongoing open source OS project, which facilitates the new generation of universal apps running anywhere, such as in AR/VR headsets, IoT gateways, game consoles, phones, PCs, TVs, and cloud servers (see Windows 10 UWP). Programmers can use any of three kinds of languages to develop applications: C/C++, Java and HTML/JS. Elastos is different from an Android-like OS in at least four aspects:</p>\r\n\r\n<ul>\r\n\t<li>Elastos has a complete set of novel C/C++ APIs and frameworks, which correspond to the Java APIs and frameworks of Android. With better performance and a smaller footprint, Elastos is a better fit for embedded systems and machines with wireless peripherals. Elastos also supports almost all Android Java and JS APIs and frameworks. POSIX APIs are deprecated.<br />\r\n\t&nbsp;</li>\r\n\t<li>Elastos has a distributed OS runtime to guarantee end-to-end security and integrity across the Internet. With built-in metadata-driven reflection technology, Elastos can automatically generate code to bridge programming modules across languages and machine boundaries. In other words, applications, services and IoT devices are prohibited from sending/receiving network packets directly, in order to fence off network attacks initiated from third party software and hardware.<br />\r\n\t&nbsp;</li>\r\n\t<li>Elastos runtime has a pioneering, service-oriented architecture, designed ideally for containers/virtual-machines. An Elastos runtime can be thought of as a CppVM (vs. JavaVM) without a leaking bottom, i.e., there are no Java-Native-Interface (JNI) equivalent mechanisms to expose the underlying physical machine or host OS. This prevents the possibility of malicious code penetrating into the system layer.<br />\r\n\t&nbsp;</li>\r\n\t<li>Elastos is decentralized across the Internet, and utilizes blockchains to authenticate user IDs, application IDs, as well as machine IDs. To build a flourishing ecosystem, anybody may freely implement their own markets, social apps, search engines, location-based services, advertisement agents, and so on, while being rewarded with Elastos coins.</li>\r\n</ul>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Open to All","speakers":[{"name":"Martin Bähr","community":"Elastos","country":"Beijing","description":"<p>Martin has been using Free Software for more than 20 years. He has lived and was active in the local Free Software community on four continents. He lived in Los Angeles once and even presented at LUG Fest IV, the predecessor to SCALE in 2001.</p>\r\n\r\n<p>He eventually settled in China where he now lives with his family, running a small Web Development Shop. He continues to be active in the Free Software community. He was running the Beijing GNU/Linux User Group for four years and now mentors his successors and he founded the Free Software Community Leadership Roundtable, a forum where community leaders can share and support each other.</p>\r\n\r\n<p>In october 2017 he joined the Elastos development team as a Community Manager.</p>\r\n\r\n<p>Through his career, his interest has always been Free Software that facilitates communication and collaboration and brings the world closer together. With Elastos he is continuing on his mission to create a better future for our global society.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Martin%20B%C3%A4hr%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/lets-fix-internet"},{"topic":true,"display":"The Boring AI in business","description":"<p><span>How R can be deployed across business operations to make an impact and how it can be seamlessly integrated with the latest AI framework to equip the business with state of art AI fire power.</span></p>\r\n\r\n<p><span>A lot of excitement on the AI applications on the direct touch point with end users in recent years. Yet the AI applications inside the business itself seems a myth that everybody talks about it and nobody really knows about it. This sharing session aims to provide an alternative view for the AI business opportunities inside the boring business operations and what are the business goals they can accomplish from these AI applications.</span></p>\r\n","venue":{"name":"Conference Hall 7"},"language":"English","level":"Beginner","speakers":[{"name":"Thomas Qian","community":"","country":"Hong Kong","description":"","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Thomas%20Qian%20w500_0.jpg"}],"internal":"https://data.hkoscon.org/event/boring-ai-business"}]},{"startTime":"17:00","endTime":"17:30","events":[{"topic":true,"display":"How OpenResty guarantees the code quality of open source projects","description":"","venue":{"name":"Conference Hall 4-5"},"language":"Mandarin","level":"","speakers":[{"name":"Ming Wen","community":"","country":"China","description":"","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ming%20Wen.jpg"}],"internal":"https://data.hkoscon.org/event/how-openresty-guarantees-code-quality-open-source-projects"},{"topic":true,"display":"Blockchain Discussion Panel","description":"","venue":{"name":"Conference Hall 6"},"language":"English","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/blockchain-discussion-panel"},{"topic":true,"display":"R Short Talks","description":"<ul>\r\n\t<li>Interpretable machine learning model, example of using gradient boosted GAM in R (March Lam)<br />\r\n\t&nbsp;</li>\r\n\t<li>Stock market data analysis with R (Tom Li)</li>\r\n</ul>\r\n","venue":{"name":"Conference Hall 7"},"language":"Bilingual (English, Cantonese)","level":"","speakers":[{"name":"March Lam","community":"R Community","country":"Hong Kong","description":"","thumbnail":""},{"name":"Tom Li","community":"R Community","country":"Hong Kong","description":"","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-06/Tom%20Li.jpg"}],"internal":"https://data.hkoscon.org/event/r-short-talks"}]},{"startTime":"17:40","endTime":"18:10","events":[{"topic":true,"display":"Data Pipeline with Apache Kafka","description":"<p>The rise of the Apache Kafka starts a new generation of data pipeline - the stream-processing pipeline.</p>\r\n\r\n<p>In this talk, Dr. Mole Wong will walk you through the concept of the stream-processing data pipeline, and how this data pipeline can be set up. He will also discuss the use cases of such a data pipeline.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"Cantonese","level":"Advanced","speakers":[{"name":"Mole Wong","community":"HK01","country":"Hong Kong","description":"<p>Dr. Mole T.Y. WONG is Data Engineer Manager in HK01 Company Limited. He is a leader of the data team in HK01. His roles include leading the data research projects, productising data science projects, as well as architecting the data pipeline in HK01.</p>\r\n\r\n<p>Before joining the industry, Mole is in Senior Lecturer in CUHK, teaching various programming courses for 9 years. He is known for his passion in teaching as well as his dedication in delivering high-quality lectures, and fun is included.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Mole%20Wong.jpg"}],"internal":"https://data.hkoscon.org/event/data-pipeline-apache-kafka"},{"topic":true,"display":"Blockchain Discussion Panel","description":"","venue":{"name":"Conference Hall 6"},"language":"English","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/blockchain-discussion-panel"},{"topic":true,"display":"R Short Talks","description":"<ul>\r\n\t<li>Interpretable machine learning model, example of using gradient boosted GAM in R (March Lam)<br />\r\n\t&nbsp;</li>\r\n\t<li>Stock market data analysis with R (Tom Li)</li>\r\n</ul>\r\n","venue":{"name":"Conference Hall 7"},"language":"Bilingual (English, Cantonese)","level":"","speakers":[{"name":"March Lam","community":"R Community","country":"Hong Kong","description":"","thumbnail":""},{"name":"Tom Li","community":"R Community","country":"Hong Kong","description":"","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-06/Tom%20Li.jpg"}],"internal":"https://data.hkoscon.org/event/r-short-talks"}]},{"startTime":"18:10","endTime":"18:15","events":[{"topic":false,"display":"Announcement","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/announcement"}]}]},{"day":2,"date":"2018-06-17","timeslots":[{"startTime":"09:30","endTime":"10:00","events":[{"topic":false,"display":"Reception","description":"<p>Volunteers will be receiving all participants and guests at the reception area.</p>\r\n","venue":{"name":"Reception Area"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/reception"}]},{"startTime":"10:10","endTime":"10:40","events":[{"topic":true,"display":"Run Multiple Isolated Web Applications on Containers with a Single IP in the Cloud","description":"<p>The introduction of the logic and step-by-step walk-through of a simple container based environment in the cloud serving multiple small web applications via a single IP address with an automated NGINX reverse proxy container. Components will include:</p>\r\n\r\n<ul>\r\n\t<li>Amazon Web Services (AWS) EC2</li>\r\n\t<li>Ubuntu Linux 16.04 (AWS AMI)</li>\r\n\t<li>DNS Configurations &amp; SSL certs</li>\r\n\t<li>Docker</li>\r\n\t<li>Docker Images:\r\n\t<ul>\r\n\t\t<li>ubuntu:xenial</li>\r\n\t\t<li>jwilder/nginx-proxy - automated reverse proxy</li>\r\n\t\t<li>wordpress:latest</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>An entry point into understanding foundational concepts of containerization before diving into the more advanced technologies like Kubernetes and CI/CD into orchestrated container clusters.</p>\r\n\r\n<p>This talk will be based on the speaker’s latest post on it next.io:</p>\r\n\r\n<p><a href=\"https://itnext.io/run-multiple-isolated-web-applications-on-containers-with-a-single-ip-for-free-52d216f3e810\">Run Multiple Isolated Web Applications on Containers with a Single IP for&nbsp;Free</a></p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Beginner","speakers":[{"name":"Jeremy Cheng","community":"Principal, Dragon Ventures","country":"Hong Kong","description":"<p>Jeremy Cheng is an open source enthusiast, technologist, serial entrepreneur, and former corporate executive with 20+ years of industry experience across both the United States and the Greater China Region. He has been fascinated with open source technologies since the early 1990’s and led countless open source technology adoption initiatives in the past for organizations of a wide range of nature and sizes.</p>\r\n\r\n<p>Jeremy is currently the principal at Dragon Ventures, an international consultancy specialized in technology adoption, project management, fund raising, and cross border GTM strategy. He’s also the founder and principal architect of 3DF, a Hong Kong based IT Ops and DevOps consultancy, and MXI, a US based international management consultancy with over 300 contractors across the globe. Prior to his recent entrepreneurial endeavors, he led a team of senior and principal engineers in managing all of Microsoft’s R&amp;D datacenters and its internal DevOps services worldwide.</p>\r\n\r\n<p>Aside from Microsoft, he previously served as the Director of IT at Imagekind, Inc., and was actively involved in IT management strategy, business operations, web applications architecture, DevOps, and implementations. During his time with Imagekind, he was instrumental in Imagekind’s exit when it was acquired by Cafepress, Inc in 2008. Before Imagekind, Jeremy was the Technical Services Manager for a Seattle based security solutions provider, where he managed the IT infrastructure and network-based enterprise security management systems in both production and development environments; a product used by the FBI, US Navy, WSDOT, Global Crossing, Pemco Insurance, and Holland America.</p>\r\n\r\n<p>Jeremy began his career during the \"IT bubble\" in the 90's focusing on computer networks and integrated systems. He holds a BS in Informatics and a BA in Economics from the University of Washington. He also holds a certificate for Information Assurance and Cyber Security from the University of Washington and is an Amazon Web Services (AWS) Certified Solutions Architect Associate.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Jeremy%20Cheng.jpg"}],"internal":"https://data.hkoscon.org/event/run-multiple-isolated-web-applications-containers-single-ip-cloud"},{"topic":true,"display":"Heading to the New Stage of MySQL 8.0","description":"<p>The MySQL 8.0 has many features.&nbsp; Take a look at the New features including the Developer Productivity, Performance, Usability.&nbsp;&nbsp; e.g. GIS features in 8.0, JSON and Document Store, MySQL Security, Atomic DDL, Resource Group, Recursive CTE, etc.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Beginner","speakers":[{"name":"Ivan Ma","community":"Hong Kong MySQL User Group","country":"Hong Kong","description":"<p>Ivan Ma is the MySQL User Group Lead in Hong Kong. He has over 20+ years of experience in enterprise system infrastructure and software technologies. He has certification on MySQL DBA 5.6, MySQL Developer 5.1 and MySQL Cluster 5.1 DBA.</p>\r\n\r\n<p>He Joined MySQL, is currently MySQL Principal Sales Consultant, Asia Pacific with Oracle, responsible for pre-sales consulting, technical education, and product promotions.</p>\r\n\r\n<p>Prior to joining MySQL team, he joined Oracle in System Team from Sun Mircosystems acquisition. Prior to Sun Microsystems, he was Principal Solution Architect with Sybase APAC covering APAC regions.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ivan%20Ma%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/heading-new-stage-mysql-80"},{"topic":true,"display":"齊來造返個廣東話字","description":"<p>香港經常會談及捍衛廣東話的議題，但對廣東話的字認識不多。如何透過自由開源運動，鼓勵更多人認識廣東話字。</p>\r\n","venue":{"name":"Conference Hall 7"},"language":"Cantonese","level":"Beginner","speakers":[{"name":"Kingman Leung","community":"自由香港字型 (Free HK Fonts)","country":"Hong Kong","description":"<p>一位熱心推動香港「世代團結、長幼共融」的社會工作者，組織長者參與自由開源的開發。</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Kingman%20Leung%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/qilaizaofangeguangdonghuazi"}]},{"startTime":"10:50","endTime":"11:20","events":[{"topic":true,"display":"Scaling TB's of data with Apache Spark and Scala DSL at Production","description":"<p>Apache Spark is one of the top big-data processing platforms and has driven the adoption of Scala in many industry and academic settings. As entire Apache Spark framework has been written in Scala as a base, it’s real pleasure to understand beauty of functional Scala DSL with Spark.</p>\r\n\r\n<p>This talk is intent to present :</p>\r\n\r\n<ul>\r\n\t<li>Primary data structures (RDD, DataSet, Dataframe) usage in universal large scale data processing with Hbase (Data lake), Hive (Analytical Engine).</li>\r\n\t<li>Case study: We will go through importance of physical data split up techniques such as coalesce, Partition, Repartition and other important spark internals in Scaling TB’s of data / ~17 billions records</li>\r\n\t<li>Also, We will understand crucial part and very interesting way of understanding parallel &amp; concurrent distributed data processing – tuning memory, cache, Disk I/O, Leaking memory, Internal shuffle, spark executor, spark driver etc.</li>\r\n</ul>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Intermediate","speakers":[{"name":"Chetankumar Khatri","community":"Accion labs Inc.","country":"India","description":"<p><span>Chetan Khatri is working as a Technical Lead at Accion labs, he has diverse experience in field of Data Science and Machine learning. He is a open source contributor at Apache Spark, Apache HBase, Apache Spark - HBase Connector, Elixir Lang and many other open source projects. He has been authored curriculum of Artificial Intelligence, Data Science, Distributed computing at KSKV Kachchh University, Government of Gujarat - INDIA. He has also reviewed couple of Books with Scala Machine learning, Tensorflow Deep learning, Machine learning for Web with Packt Publication. He has delivered many talks at Pycon India 2016, PyKutch 2016, FOSSASIA 2018</span></p>\r\n\r\n<ul>\r\n\t<li><span>Distributing Machine learning with Apache Spark - Pycon India 2016</span></li>\r\n\t<li><span>Think Machine learning with Scikit-learn - PyKutch 2016</span></li>\r\n</ul>\r\n\r\n<p><span>Open Source Contributor:</span></p>\r\n\r\n<ul>\r\n\t<li><span>Apache Spark</span></li>\r\n\t<li><span>Apache HBase</span></li>\r\n\t<li><span>Apache MXNet</span></li>\r\n\t<li><span>ParlAI</span></li>\r\n\t<li><span>Spark HBase Connector </span></li>\r\n</ul>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Chetan%20Khatri%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/scaling-tbs-data-apache-spark-and-scala-dsl-production"},{"topic":true,"display":"Crossing Relation and Document Database using MySQL","description":"<p>Hybrid database with relational and Document for application becomes very popular.&nbsp;&nbsp; A flexible schema with JSON datatype to allow developers to design a flexible data architecture is handy and simple in MySQL.&nbsp;&nbsp; JSON data in data exchange no matter this is Mobile application or traditional application becomes a de-facto standard.&nbsp; We need JSON data but we need relational database.&nbsp;&nbsp; MySQL document store + X Dev API allows both trendy application design + relational model application to work together.&nbsp; Come to hear from the talk, we will share the latest and greatest features in MySQL Document Store.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Beginner","speakers":[{"name":"Ryusuke Kajiyama","community":"Oracle","country":"Japan","description":"<p>Ryusuke Kajiyama is Open Source Specialist with 10+ years of experience of systems design using MySQL and open source solutions. He originally joined MySQL AB, and is currently managing MySQL Sales Consultant team of Asia Pacific region at Oracle. Prior to join MySQL, he was Consultant at Nomura Research Institute, working on enterprise systems design with Oracle Database, WebLogic, Solaris, and various Open Source software including MySQL, JBoss and Linux. He is a Co-Founder of Japan JBoss Users Group.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ryusuke%20Kajiyama.jpg"}],"internal":"https://data.hkoscon.org/event/crossing-relation-and-document-database-using-mysql"},{"topic":true,"display":"齊來造返個廣東話字","description":"<p>香港經常會談及捍衛廣東話的議題，但對廣東話的字認識不多。如何透過自由開源運動，鼓勵更多人認識廣東話字。</p>\r\n","venue":{"name":"Conference Hall 7"},"language":"Cantonese","level":"Beginner","speakers":[{"name":"Kingman Leung","community":"自由香港字型 (Free HK Fonts)","country":"Hong Kong","description":"<p>一位熱心推動香港「世代團結、長幼共融」的社會工作者，組織長者參與自由開源的開發。</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Kingman%20Leung%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/qilaizaofangeguangdonghuazi"}]},{"startTime":"11:20","endTime":"11:50","events":[{"topic":false,"display":"Morning Break & Expo","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/morning-break-expo"}]},{"startTime":"11:50","endTime":"12:20","events":[{"topic":true,"display":"Fn project: How serverless empowers developers to adopt different programming languages","description":"<p>The idea of adopting multiple programming languages to build highly distributed applications is not new to anyone. We all been taught to use necessary toolkits to solve certain problems in the most efficient way. 12Factor concept helped us to understand how to shift from the monolithic applications to smaller functional units - microservices, with that we can extract the most critical pieces of code into a microservice that can be made natively fault-tolerant. But where is the limit to the number of microservices within one application, when the application becomes sort of the nightmare to those who maintain that?</p>\r\n\r\n<p>The serverless concept (namely serverless architecture pattern) is the next MUST technology to adopt for the application development. With the serverless developers can stop worrying about the number of components necessary to have up and running for the sake of the stability and fault-tolerance.</p>\r\n\r\n<p>In this talk, i would like you to join me towards modern distributed application development with the Fn platform - open source non-vendor-lock serverless technology.</p>\r\n\r\n<p>As the result you might get the following takeaways:</p>\r\n\r\n<ul>\r\n\t<li>Serverless is not something you should be afraid of;</li>\r\n\t<li>How to develop the microservices using serverless architecture pattern;</li>\r\n\t<li>The upsides and the downsides of the serverless.</li>\r\n</ul>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Intermediate","speakers":[{"name":"Matt Stephenson","community":"Oracle","country":"United States","description":"<p><span>Matt Stephenson is a Senior Principal Software Engineer at Oracle working on creating a hosted Fn implementation on top of Oracle's Cloud. Matt built some of the underlying infrastructure components that run parts of AWS while at Amazon. Matt also built out the AppEngine java runtime while at Google. Matt is on the PMC for Apache jclouds and also contributes to Jenkins, OpenStack, and of course the Fn project. In his free time he helps design the man at Burningman and flies airplanes.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Matt%20Stephenson.jpg"}],"internal":"https://data.hkoscon.org/event/fn-project-how-serverless-empowers-developers-adopt-different-programming-languages"},{"topic":true,"display":"Raspberry Pi R3 - Scalable High Availability MySQL InnoDB Cluster and Apache Kafka® Distributed Streaming Platform - Resiliency Testing","description":"<p>Demonstrating \"Real World Clustering and Distributed Processing Platform Scale-up\"&nbsp; technologies on a small scale and budget. Use Open Source technology and middleware to \"model and mimic\" high cost distributed clustered and/or supercomputer style architectures. Bench Test and manage and test Resiliency in clustered environments on \"Real Physical Hardware\" that virtualisation may never truly emulate.... and it's Fun!!!</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Intermediate","speakers":[{"name":"Karl Ring","community":"HKOUG - Hong Kong Oracle User Group (Committee Member)","country":"Hong Kong","description":"<p>Senior Database Management Lead. Database and Linux Administration,&nbsp; Automation, Installation, Configuration,&nbsp; Performance Tuning, Backup &amp; Recovery,&nbsp; and Management specialist. Specializing in large corporate environment management within Banking, Finance, Warehousing, &amp; Telecommunications industrial sectors.&nbsp;</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Karl%20Ring%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/raspberry-pi-r3-scalable-high-availability-mysql-innodb-cluster-and-apache-kafkar-distributed"},{"topic":true,"display":"Open Source of Agriculture","description":"<p>We started a smart farming group in 2017, and developed tools with loT, data analysis, computer vision, and robot technology. It can help farmers to monitor and optimize the food production.</p>\r\n","venue":{"name":"Conference Hall 7"},"language":"Mandarin","level":"","speakers":[{"name":"Hsing-Yen Chen","community":"Open Hack Farm","country":"Taiwan","description":"<p>John started exploring agricultural industry, working on ecological and low carbon agriculture. Inspired by Open Source Ecology community, he hopes to apply the spirit to cultivate more creatures and strengthen connections between people.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Hsing-Yen%20Chen%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/open-source-agriculture"}]},{"startTime":"12:30","endTime":"13:00","events":[{"topic":true,"display":"Video.js with HLS","description":"<p>Flash Player with RMTP was the most popular streaming technology. As Flash is fading out, I am going to introduce how to replace it with Video.js player with HTTP Live Stream (HLS)</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"Cantonese","level":"Intermediate","speakers":[{"name":"Sunday Ku","community":"HK01","country":"Hong Kong","description":"<p><span>Web engineer with experience on React, Node.js and AWS. Former software engineer in Lifehack.org</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Sunday%20Ku%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/videojs-hls"},{"topic":true,"display":"MySQL Fault Tolerant Best Practice - Lesson Learned from cases that I experienced","description":"<p>This session will share you the benefits, disadvantages and possible pitfalls of various with MySQL High Availability solutions (including shared storage plus Clusterware, Master-slave replication, Group Replication, and DB Cluster) and how to avoid the pitfall. I also will concludes my experience from several MySQL implementation projects, hope you may learn how to apply the right solutions for your applications and how to make the best from those solutions.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"Mandarin","level":"Intermediate","speakers":[{"name":"Ivan Tu","community":"Taiwan MySQL User Group","country":"Taiwan","description":"<p>At Oracle Japan &amp; APAC Sales Consultant team since 2010. my job is helping&nbsp; MySQL users and customers adopt MySQL, and promoting MySQL techniques in this region, I also organizes MySQL User Group Community in Taiwan.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ivan%20Tu.jpg"}],"internal":"https://data.hkoscon.org/event/mysql-fault-tolerant-best-practice-lesson-learned-cases-i-experienced"},{"topic":true,"display":"Refactoring Gibbon","description":"<p>A brief look at the history of the Gibbon project, and our recent work to refactor a legacy codebase.</p>\r\n","venue":{"name":"Conference Hall 7"},"language":"English","level":"Intermediate","speakers":[{"name":"Ross Parker","community":"Gibbon","country":"Hong Kong","description":"<p><span>Ross Parker is a teacher with a passion for engaging students around understanding, using, demystifying and building computer technologies. As a passionate creator of technology, Ross has spent 10 years involved in designing and coding school software. Most recently, Ross has been focusing his coding energies into founding and building Gibbon (https://gibbonedu.org), the open source school platform. In addition to teaching, Ross is responsible for leading technology, pedagogy and assessment at ICHK Secondary. As an educator, Ross is committed to giving students the choice and freedom to find their own passion, the support and encouragement to develop understanding and skills, and the intellectual tools and curiosity to make up their own minds about life. As a public speaker Ross has presented a variety of tech-themed content through conferences, workshops, as a panel expert and as a regular on RTHK Radio 3.</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ross%20Parker%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/refactoring-gibbon"}]},{"startTime":"13:10","endTime":"13:40","events":[{"topic":false,"display":"Lunch & Expo","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/lunch-expo"},{"topic":false,"display":"Lightening Talk","description":"","venue":{"name":"Conference Hall 4-5"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/lightening-talk"},{"topic":true,"display":"MySQL Group Replication在金融场景的应用实践","description":"<p>MySQL 数据库已广泛用于腾讯金融与支付各个核心应用场景，5.7 新推出的基于 Paxos 协议的MySQL Group Replication（MGR）将会是未来金融业务的高可用架构基础。本次分享将介绍MGR与传统复制架构的对比和优势，以及分享腾讯在 MGR 的应用实践</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Intermediate","speakers":[{"name":"姜承尧","community":"Tencent","country":"China","description":"<p>腾讯金融数据库负责人</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Jiang%20Cheng%20Yao%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/mysql-group-replicationzaijinrongchangjingdeyingyongshijian"},{"topic":true,"display":"Unconference, Track 1","description":"","venue":{"name":"Conference Hall 7"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/unconference-track-1"}]},{"startTime":"13:40","endTime":"14:30","events":[{"topic":false,"display":"Lunch & Expo","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/lunch-expo"}]},{"startTime":"13:50","endTime":"14:20","events":[{"topic":true,"display":"Unconference, Track 1","description":"","venue":{"name":"Conference Hall 7"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/unconference-track-1"},{"topic":true,"display":"Unconference, Track 2","description":"","venue":{"name":"Conference Hall 7"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/unconference-track-2"}]},{"startTime":"14:30","endTime":"15:00","events":[{"topic":true,"display":"Browsers: Behind the scenes!","description":"<p>In this talk, I will be talking about the high-level architecture of browser and there components like rendering engine. What happens when you search for something on the internet? How are browsers rendering HTML/CSS/JS for you?&nbsp; How parsing and Layout things works in browser? How and Why Firefox quantum is fast? What was the role of stylo in making it fast?&nbsp; Browser's understands us, now let's try to understand your browser.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Intermediate","speakers":[{"name":"Rakhi Sharma","community":"The Data Team and Mozilla","country":"India","description":"<p>I am a Software Engineer and an open source contributor.&nbsp; I contribute to Servo browser Enginer. I was Outreachy and RGSoC intern at Mozilla in 2016 &amp; 17. Also I am a co-organizer of meetup group @diversifyfoss</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Rakhi%20Sharma.jpg"}],"internal":"https://data.hkoscon.org/event/browsers-behind-scenes"},{"topic":true,"display":"Managing the domain names of your open source projects with Gandi","description":"<p>A brief introduction to Gandi CLI, Gandi's API and how to manage your Opensource organisation with Gandi's new website.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"","level":"","speakers":[{"name":"Ryo Yamamoto","community":"Gandi.net","country":"Japan","description":"<p>Ryo is originally from Kobe and now based in Taipei since January.</p>\r\n\r\n<p>He is currently in charge of Japanese localization at Gandi.</p>\r\n\r\n<p>Before this, he worked for seven years at a Boston-based Edtech Startup.</p>\r\n\r\n<p>Among his hobbies are photography, writing python code and learning languages.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Ryo%20Yamamoto.jpg"}],"internal":"https://data.hkoscon.org/event/managing-domain-names-your-open-source-projects-gandi"},{"topic":true,"display":"Unconference, Track 2","description":"","venue":{"name":"Conference Hall 7"},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/unconference-track-2"}]},{"startTime":"15:10","endTime":"15:40","events":[{"topic":true,"display":"Mixed Reality for the Web","description":"<p>Mozilla announced a new development program for Mixed Reality that will significantly expand its work in Virtual Reality (VR) and Augmented Reality (AR) for the web. The initial focus will be on how to get devices, headsets, frameworks and toolsets to work together, so web developers can choose from a variety of tools and publishing methods to bring new immersive experiences online – and have them work together in a fully functional way.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Beginner","speakers":[{"name":"Robert \"Bob\" Reyes","community":"Mozilla","country":"Philippines","description":"<p><span>Robert \"Bob\"&nbsp;Reyes is a Mozilla Rep and Reps Mentor based in Makati City, Philippines. He has been an active contributor to the Mozilla project in the area of localization since 2003. He has been representing the organization in the country since 2011 and has been twice elected to be part of the global organization's leadership as a council member. Bob is now part of Mozilla's Tech Speakers group, which aims to Increase developer awareness and adoption of the Web, Firefox, and Mozilla through a strong community-driven technical speaker development program. Bob is also a Technology Columnist for the Manila Bulletin and Team Manager for the grassroots football team SIPFC. He is a dad to Xeon and Haswell.\"</span></p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Robert%20Reyes%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/mixed-reality-web"}]},{"startTime":"15:40","endTime":"16:10","events":[{"topic":false,"display":"Afternoon Break & Expo","description":"","venue":{"name":""},"language":"","level":"","speakers":[],"internal":"https://data.hkoscon.org/event/afternoon-break-expo"}]},{"startTime":"16:10","endTime":"16:40","events":[{"topic":true,"display":"Practical JavaScript Fuzzing","description":"<p>In previous HKOSCONs, I gave talks on introductions to fuzzing. In this session, I will give a demonstration on how to set up the open source funfuzz framework to test the SpiderMonkey engine on the Gecko platform, used in Firefox browsers.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Advanced","speakers":[{"name":"Gary Kwong","community":"Mozilla Corporation","country":"United States","description":"<p>Gary Kwong is a senior security engineer at Mozilla and a long-time member of its community. He specialises in running JavaScript fuzzers that rigorously test SpiderMonkey - the JavaScript engine of the Gecko platform on which Mozilla Firefox is based. Gary is passionate about global cultures, languages and West Coast Swing / classic Hustle dancing.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Gary%20Kwong%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/practical-javascript-fuzzing"},{"topic":true,"display":"Disruption to the System: How Open Data is changing Genomic Research","description":"<p>Genetic research takes an important role in the drive for more personalized medicine by providing a deeper look into the genetic makeup of various diseases.However, these data driven analysis require thousands of subjects, thus driving the cost into millions of US Dollars.</p>\r\n\r\n<p>Thus, only a handful of institutions were able to effectively do large scale genetic analysis on diseases such as Diabetes and Schizophrenia. While summary statistics of these analyses are freely shared among researchers and used it subsequent analysis, scientist at smaller institutions hardly ever have the chance of applying novel ideas to the raw data.</p>\r\n\r\n<p>However, all this changed with the introduction of the UK BioBank, a database with genomic, biochemical, and neuroimaging information on over 500,000 subjects. Interestingly, the data was made freely available to all research institutions around the world. Without any majore restrictions. Hence, changing the landscape of how we do genetic research forever.</p>\r\n\r\n<p>Within this talk I aim to show how open data changed genomic research. How it accelerated research progress and how it changed (or not changed) the power structure among institutions and scientists.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"English","level":"Intermediate","speakers":[{"name":"Robert Milan Porsch","community":"The University of Hong Kong","country":"Hong Kong","description":"<p>Current PostDoc at the Center of Genomic Science.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Robert%20Milan%20Porsch.jpg"}],"internal":"https://data.hkoscon.org/event/disruption-system-how-open-data-changing-genomic-research"}]},{"startTime":"16:50","endTime":"17:20","events":[{"topic":true,"display":"Practical JavaScript Fuzzing","description":"<p>In previous HKOSCONs, I gave talks on introductions to fuzzing. In this session, I will give a demonstration on how to set up the open source funfuzz framework to test the SpiderMonkey engine on the Gecko platform, used in Firefox browsers.</p>\r\n","venue":{"name":"Conference Hall 4-5"},"language":"English","level":"Advanced","speakers":[{"name":"Gary Kwong","community":"Mozilla Corporation","country":"United States","description":"<p>Gary Kwong is a senior security engineer at Mozilla and a long-time member of its community. He specialises in running JavaScript fuzzers that rigorously test SpiderMonkey - the JavaScript engine of the Gecko platform on which Mozilla Firefox is based. Gary is passionate about global cultures, languages and West Coast Swing / classic Hustle dancing.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/Gary%20Kwong%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/practical-javascript-fuzzing"},{"topic":true,"display":"Deploy a serverless chat bot quick with Skygear","description":"<p>Alternative to AWS lambda - Skygear is also a quick way to write cloud functions.</p>\r\n\r\n<p>Showing (and making) a Python based Chat bot quick with Skygear Cloud functions.</p>\r\n","venue":{"name":"Conference Hall 6"},"language":"Cantonese","level":"Beginner","speakers":[{"name":"David Ng","community":"Skygear","country":"Hong Kong","description":"<p>Software Engineer at Skygear, an open source backend for mobile apps.</p>\r\n","thumbnail":"https://data.hkoscon.org/sites/default/files/2018-05/David%20Ng%20w500.jpg"}],"internal":"https://data.hkoscon.org/event/deploy-serverless-chat-bot-quick-skygear"}]}]}]}